#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 1s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.data.azapi_resource.purview[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azapi_resource" "purview" {
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m location               = (known after apply)
      [32m+[0m[0m output                 = (known after apply)
      [32m+[0m[0m resource_id            = (known after apply)
      [32m+[0m[0m response_export_values = [
          [32m+[0m[0m "properties.managedResources.storageAccount",
          [32m+[0m[0m "properties.managedResources.eventHubNamespace",
        ]
      [32m+[0m[0m tags                   = (known after apply)
      [32m+[0m[0m type                   = "Microsoft.Purview/accounts@2021-07-01"
    }

[1m  # module.data_management_zone.azapi_resource.databricks_private_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "databricks_private_subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.16.64/26"
                  [32m+[0m[0m delegations                       = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name       = "DatabricksSubnetDelegation"
                          [32m+[0m[0m properties = {
                              [32m+[0m[0m serviceName = "Microsoft.Databricks/workspaces"
                            }
                        },
                    ]
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DatabricksPrivateSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azapi_resource.databricks_public_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "databricks_public_subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.16.128/26"
                  [32m+[0m[0m delegations                       = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name       = "DatabricksSubnetDelegation"
                          [32m+[0m[0m properties = {
                              [32m+[0m[0m serviceName = "Microsoft.Databricks/workspaces"
                            }
                        },
                    ]
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DatabricksPublicSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azapi_resource.private_endpoint_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "private_endpoint_subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.16.0/27"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "ServicesSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azurerm_container_registry.container_registry[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_enabled                 = false
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m anonymous_pull_enabled        = false
      [32m+[0m[0m data_endpoint_enabled         = false
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = true
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "mydmgmtdevacr001"
      [32m+[0m[0m network_rule_bypass_option    = "None"
      [32m+[0m[0m network_rule_set              = [
          [32m+[0m[0m {
              [32m+[0m[0m default_action = "Deny"
            },
        ]
      [32m+[0m[0m public_network_access_enabled = false
      [32m+[0m[0m quarantine_policy_enabled     = true
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-container-rg"
      [32m+[0m[0m retention_policy              = [
          [32m+[0m[0m {
              [32m+[0m[0m days    = 7
              [32m+[0m[0m enabled = true
            },
        ]
      [32m+[0m[0m sku                           = "Premium"
      [32m+[0m[0m trust_policy                  = [
          [32m+[0m[0m {
              [32m+[0m[0m enabled = false
            },
        ]
      [32m+[0m[0m zone_redundancy_enabled       = true

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.azurerm_databricks_access_connector.databricks_access_connector[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-dbac001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-unity-rg"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.azurerm_databricks_workspace.databricks[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_workspace" "databricks" {
      [32m+[0m[0m customer_managed_key_enabled          = false
      [32m+[0m[0m disk_encryption_set_id                = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled     = true
      [32m+[0m[0m location                              = "northeurope"
      [32m+[0m[0m managed_disk_identity                 = (known after apply)
      [32m+[0m[0m managed_resource_group_id             = (known after apply)
      [32m+[0m[0m managed_resource_group_name           = "mydmgmt-dev-cnsmptn-dbw001-rg"
      [32m+[0m[0m name                                  = "mydmgmt-dev-cnsmptn-dbw001"
      [32m+[0m[0m network_security_group_rules_required = "NoAzureDatabricksRules"
      [32m+[0m[0m public_network_access_enabled         = false
      [32m+[0m[0m resource_group_name                   = "mydmgmt-dev-consumption-rg"
      [32m+[0m[0m sku                                   = "premium"
      [32m+[0m[0m storage_account_identity              = (known after apply)
      [32m+[0m[0m workspace_id                          = (known after apply)
      [32m+[0m[0m workspace_url                         = (known after apply)

      [32m+[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [32m+[0m[0m no_public_ip                                         = true
          [32m+[0m[0m private_subnet_name                                  = "DatabricksPrivateSubnet"
          [32m+[0m[0m private_subnet_network_security_group_association_id = (known after apply)
          [32m+[0m[0m public_ip_name                                       = (known after apply)
          [32m+[0m[0m public_subnet_name                                   = "DatabricksPublicSubnet"
          [32m+[0m[0m public_subnet_network_security_group_association_id  = (known after apply)
          [32m+[0m[0m storage_account_name                                 = "mydmgmtdevcnsmptndbw001"
          [32m+[0m[0m storage_account_sku_name                             = "Standard_LRS"
          [32m+[0m[0m virtual_network_id                                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
          [32m+[0m[0m vnet_address_prefix                                  = (known after apply)
        }
    }

[1m  # module.data_management_zone.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "mydmgmt-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "None"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.container_registry_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevacr001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevacr001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-container-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevacr001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevacr001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "registry",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.databricks_private_endpoint_ui[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_ui" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-cnsmptn-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-cnsmptn-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-cnsmptn-dbw001-uiapi-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-cnsmptn-dbw001-uiapi-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.databricks_private_endpoint_web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-cnsmptn-dbw001-web-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-cnsmptn-dbw001-web-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-cnsmptn-dbw001-web-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-cnsmptn-dbw001-web-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "browser_authentication",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.datalake_private_endpoint_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevst001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevst001-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-unity-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevst001-blob-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevst001-blob-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.datalake_private_endpoint_dfs[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevst001-dfs-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevst001-dfs-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-unity-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevst001-dfs-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevst001-dfs-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dfs",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.key_vault_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-kv001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-kv001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-kv001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-account-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-account-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-account-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-account-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "account",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-pe-blob"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-blob-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-blob-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_namespace[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_namespace" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-namespace-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-pe-namespace"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-namespace-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-namespace-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "namespace",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_portal[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_portal" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-portal-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-portal-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-portal-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.purviewstudio.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-portal-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "portal",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_queue[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_queue" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-pe-queue"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-queue-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-queue-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.synapse_pl_hub_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "synapse_pl_hub_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevsynplh001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevsynplh001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevsynplh001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevsynplh001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "web",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_purview_account.purview[0m will be created
[0m  [32m+[0m[0m resource "azurerm_purview_account" "purview" {
      [32m+[0m[0m atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      [32m+[0m[0m atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      [32m+[0m[0m catalog_endpoint                                 = (known after apply)
      [32m+[0m[0m guardian_endpoint                                = (known after apply)
      [32m+[0m[0m id                                               = (known after apply)
      [32m+[0m[0m location                                         = "northeurope"
      [32m+[0m[0m managed_resource_group_name                      = "mydmgmt-dev-pview001-rg"
      [32m+[0m[0m managed_resources                                = (known after apply)
      [32m+[0m[0m name                                             = "mydmgmt-dev-pview001"
      [32m+[0m[0m public_network_enabled                           = false
      [32m+[0m[0m resource_group_name                              = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m scan_endpoint                                    = (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.azurerm_resource_group.automation_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "automation_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-automation-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "consumption_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-consumption-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.container_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "container_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-container-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.governance_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "governance_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-governance-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.unity_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "unity_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-unity-rg"
    }

[1m  # module.data_management_zone.azurerm_role_assignment.current_roleassignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_storage" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_role_assignment.databricks_access_connector_roleassignment_datalake[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "databricks_access_connector_roleassignment_datalake" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_role_assignment.purview_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_role_assignment.user_assigned_identity_roleassignment_governance_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_governance_rg" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_storage_account.datalake[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "datalake" {
      [32m+[0m[0m access_tier                       = "Hot"
      [32m+[0m[0m account_kind                      = "StorageV2"
      [32m+[0m[0m account_replication_type          = "ZRS"
      [32m+[0m[0m account_tier                      = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public   = false
      [32m+[0m[0m allowed_copy_scope                = "AAD"
      [32m+[0m[0m cross_tenant_replication_enabled  = false
      [32m+[0m[0m default_to_oauth_authentication   = true
      [32m+[0m[0m enable_https_traffic_only         = true
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = true
      [32m+[0m[0m is_hns_enabled                    = true
      [32m+[0m[0m large_file_share_enabled          = false
      [32m+[0m[0m location                          = "northeurope"
      [32m+[0m[0m min_tls_version                   = "TLS1_2"
      [32m+[0m[0m name                              = "mydmgmtdevst001"
      [32m+[0m[0m nfsv3_enabled                     = false
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m public_network_access_enabled     = true
      [32m+[0m[0m queue_encryption_key_type         = "Account"
      [32m+[0m[0m resource_group_name               = "mydmgmt-dev-unity-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m sftp_enabled                      = false
      [32m+[0m[0m shared_access_key_enabled         = false
      [32m+[0m[0m table_encryption_key_type         = "Account"

      [32m+[0m[0m blob_properties {
          [32m+[0m[0m change_feed_enabled      = false
          [32m+[0m[0m default_service_version  = (known after apply)
          [32m+[0m[0m last_access_time_enabled = false
          [32m+[0m[0m versioning_enabled       = false

          [32m+[0m[0m container_delete_retention_policy {
              [32m+[0m[0m days = 7
            }

          [32m+[0m[0m cors_rule {
              [32m+[0m[0m allowed_headers    = [
                  [32m+[0m[0m "x-ms-blob-type",
                ]
              [32m+[0m[0m allowed_methods    = [
                  [32m+[0m[0m "PUT",
                ]
              [32m+[0m[0m allowed_origins    = [
                  [32m+[0m[0m "https://*.azuredatabricks.net",
                ]
              [32m+[0m[0m exposed_headers    = [
                  [32m+[0m[0m "",
                ]
              [32m+[0m[0m max_age_in_seconds = 1800
            }

          [32m+[0m[0m delete_retention_policy {
              [32m+[0m[0m days = 7
            }
        }

      [32m+[0m[0m network_rules {
          [32m+[0m[0m bypass                     = [
              [32m+[0m[0m "None",
            ]
          [32m+[0m[0m default_action             = "Deny"
          [32m+[0m[0m ip_rules                   = (known after apply)
          [32m+[0m[0m virtual_network_subnet_ids = (known after apply)

          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Databricks/accessConnectors/*"
              [32m+[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*"
              [32m+[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
        }

      [32m+[0m[0m routing {
          [32m+[0m[0m choice                      = "MicrosoftRouting"
          [32m+[0m[0m publish_internet_endpoints  = false
          [32m+[0m[0m publish_microsoft_endpoints = false
        }
    }

[1m  # module.data_management_zone.azurerm_storage_container.datalake_container_unity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "datalake_container_unity" {
      [32m+[0m[0m container_access_type   = "private"
      [32m+[0m[0m has_immutability_policy = (known after apply)
      [32m+[0m[0m has_legal_hold          = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m metadata                = (known after apply)
      [32m+[0m[0m name                    = "unitynortheurope"
      [32m+[0m[0m resource_manager_id     = (known after apply)
      [32m+[0m[0m storage_account_name    = "mydmgmtdevst001"
    }

[1m  # module.data_management_zone.azurerm_storage_management_policy.datalake_management_policy[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_management_policy" "datalake_management_policy" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m storage_account_id = (known after apply)

      [32m+[0m[0m rule {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m name    = "default"

          [32m+[0m[0m actions {
              [32m+[0m[0m base_blob {
                  [32m+[0m[0m delete_after_days_since_creation_greater_than                  = -1
                  [32m+[0m[0m delete_after_days_since_last_access_time_greater_than          = -1
                  [32m+[0m[0m delete_after_days_since_modification_greater_than              = -1
                  [32m+[0m[0m tier_to_archive_after_days_since_creation_greater_than         = -1
                  [32m+[0m[0m tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  [32m+[0m[0m tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  [32m+[0m[0m tier_to_archive_after_days_since_modification_greater_than     = -1
                  [32m+[0m[0m tier_to_cool_after_days_since_creation_greater_than            = -1
                  [32m+[0m[0m tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  [32m+[0m[0m tier_to_cool_after_days_since_modification_greater_than        = 360
                }
              [32m+[0m[0m snapshot {
                  [32m+[0m[0m change_tier_to_archive_after_days_since_creation               = -1
                  [32m+[0m[0m change_tier_to_cool_after_days_since_creation                  = 180
                  [32m+[0m[0m delete_after_days_since_creation_greater_than                  = 360
                  [32m+[0m[0m tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
              [32m+[0m[0m version {
                  [32m+[0m[0m change_tier_to_archive_after_days_since_creation               = -1
                  [32m+[0m[0m change_tier_to_cool_after_days_since_creation                  = 180
                  [32m+[0m[0m delete_after_days_since_creation                               = 360
                  [32m+[0m[0m tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
            }

          [32m+[0m[0m filters {
              [32m+[0m[0m blob_types = [
                  [32m+[0m[0m "blockBlob",
                ]
            }
        }
    }

[1m  # module.data_management_zone.azurerm_synapse_private_link_hub.synapse_pl_hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_synapse_private_link_hub" "synapse_pl_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmtdevsynplh001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-rg"
    }

[1m  # module.data_management_zone.azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-automation-rg"
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1m  # module.data_management_zone.databricks_metastore.metastore[0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore" "metastore" {
      [32m+[0m[0m cloud                                             = (known after apply)
      [32m+[0m[0m created_at                                        = (known after apply)
      [32m+[0m[0m created_by                                        = (known after apply)
      [32m+[0m[0m delta_sharing_organization_name                   = "perfectthymetech"
      [32m+[0m[0m delta_sharing_recipient_token_lifetime_in_seconds = 0
      [32m+[0m[0m delta_sharing_scope                               = "INTERNAL"
      [32m+[0m[0m force_destroy                                     = true
      [32m+[0m[0m global_metastore_id                               = (known after apply)
      [32m+[0m[0m id                                                = (known after apply)
      [32m+[0m[0m name                                              = "perfectthymetech-northeurope"
      [32m+[0m[0m owner                                             = "baaa7885-90d9-49a6-bff0-c12ec738bf9b"
      [32m+[0m[0m region                                            = (known after apply)
      [32m+[0m[0m storage_root                                      = "abfss://mydmgmtdevst001@unitynortheurope.dfs.core.windows.net/"
      [32m+[0m[0m updated_at                                        = (known after apply)
      [32m+[0m[0m updated_by                                        = (known after apply)
    }

[1m  # module.data_management_zone.databricks_metastore_assignment.metastore_assignment[0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_assignment" "metastore_assignment" {
      [32m+[0m[0m default_catalog_name = "mydmgmt-dev-cnsmptn-dbw001"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m metastore_id         = (known after apply)
      [32m+[0m[0m workspace_id         = (known after apply)
    }

[1m  # module.data_management_zone.databricks_metastore_data_access.metastore_data_access[0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_data_access" "metastore_data_access" {
      [32m+[0m[0m configuration_type = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m is_default         = true
      [32m+[0m[0m metastore_id       = (known after apply)
      [32m+[0m[0m name               = "default-data-access"

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = (known after apply)
        }
    }

[1mPlan:[0m 37 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>